{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 96, 96, 1], "dtype": "float32", "sparse": false, "name": "input_layer"}, "registered_name": null, "name": "input_layer", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 96, 96, 1]}, "name": "zero_padding2d", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 96, 96, 1], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 102, 102, 1]}, "name": "conv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 102, 102, 1], "dtype": "float32", "keras_history": ["zero_padding2d", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 51, 51, 64]}, "name": "batch_normalization", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 51, 51, 64], "dtype": "float32", "keras_history": ["conv1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}, "registered_name": null, "name": "activation", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 51, 51, 64], "dtype": "float32", "keras_history": ["batch_normalization", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "name": "max_pooling2d", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 51, 51, 64], "dtype": "float32", "keras_history": ["activation", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "res_2_conv_a", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 25, 25, 64]}, "name": "res_2_conv_a", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 25, 25, 64], "dtype": "float32", "keras_history": ["max_pooling2d", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "name": "max_pooling2d_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 25, 25, 64], "dtype": "float32", "keras_history": ["res_2_conv_a", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 64]}, "name": "batch_normalization_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 64], "dtype": "float32", "keras_history": ["max_pooling2d_1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}, "registered_name": null, "name": "activation_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 64], "dtype": "float32", "keras_history": ["batch_normalization_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "res_2_conv_b", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 64]}, "name": "res_2_conv_b", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 64], "dtype": "float32", "keras_history": ["activation_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 64]}, "name": "batch_normalization_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 64], "dtype": "float32", "keras_history": ["res_2_conv_b", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}, "registered_name": null, "name": "activation_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 64], "dtype": "float32", "keras_history": ["batch_normalization_2", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "res_2_conv_copy", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 25, 25, 64]}, "name": "res_2_conv_copy", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 25, 25, 64], "dtype": "float32", "keras_history": ["max_pooling2d", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "res_2_conv_c", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 64]}, "name": "res_2_conv_c", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 64], "dtype": "float32", "keras_history": ["activation_2", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "name": "max_pooling2d_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 25, 25, 256], "dtype": "float32", "keras_history": ["res_2_conv_copy", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 256]}, "name": "batch_normalization_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 256], "dtype": "float32", "keras_history": ["res_2_conv_c", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 256]}, "name": "batch_normalization_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 256], "dtype": "float32", "keras_history": ["max_pooling2d_2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 12, 12, 256], [null, 12, 12, 256]]}, "name": "add", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 256], "dtype": "float32", "keras_history": ["batch_normalization_3", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 256], "dtype": "float32", "keras_history": ["batch_normalization_4", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}, "registered_name": null, "name": "activation_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 256], "dtype": "float32", "keras_history": ["add", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "res_3_conv_a", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 256]}, "name": "res_3_conv_a", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 256], "dtype": "float32", "keras_history": ["activation_3", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "name": "max_pooling2d_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 128], "dtype": "float32", "keras_history": ["res_3_conv_a", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 128]}, "name": "batch_normalization_5", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 6, 6, 128], "dtype": "float32", "keras_history": ["max_pooling2d_3", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}, "registered_name": null, "name": "activation_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 6, 6, 128], "dtype": "float32", "keras_history": ["batch_normalization_5", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "res_3_conv_b", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 128]}, "name": "res_3_conv_b", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 6, 6, 128], "dtype": "float32", "keras_history": ["activation_4", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 128]}, "name": "batch_normalization_6", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 6, 6, 128], "dtype": "float32", "keras_history": ["res_3_conv_b", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}, "registered_name": null, "name": "activation_5", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 6, 6, 128], "dtype": "float32", "keras_history": ["batch_normalization_6", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "res_3_conv_copy", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 12, 12, 256]}, "name": "res_3_conv_copy", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 256], "dtype": "float32", "keras_history": ["activation_3", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "res_3_conv_c", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": 0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 128]}, "name": "res_3_conv_c", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 6, 6, 128], "dtype": "float32", "keras_history": ["activation_5", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "name": "max_pooling2d_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 12, 12, 512], "dtype": "float32", "keras_history": ["res_3_conv_copy", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 512]}, "name": "batch_normalization_7", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 6, 6, 512], "dtype": "float32", "keras_history": ["res_3_conv_c", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 512]}, "name": "batch_normalization_8", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 6, 6, 512], "dtype": "float32", "keras_history": ["max_pooling2d_4", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 6, 6, 512], [null, 6, 6, 512]]}, "name": "add_1", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 6, 6, 512], "dtype": "float32", "keras_history": ["batch_normalization_7", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 6, 6, 512], "dtype": "float32", "keras_history": ["batch_normalization_8", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}, "registered_name": null, "name": "activation_6", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 6, 6, 512], "dtype": "float32", "keras_history": ["add_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "target_shape": [36, 512]}, "registered_name": null, "build_config": {"input_shape": [null, 6, 6, 512]}, "name": "reshape", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 6, 6, 512], "dtype": "float32", "keras_history": ["activation_6", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "Add", "config": {"name": "add_2"}, "registered_name": "Add", "name": "add_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 36, 512], "dtype": "float32", "keras_history": ["reshape", 0, 0]}}, {"class_name": "__tensor__", "config": {"value": [[0.013169120997190475, 0.010442603379487991, -0.015090622007846832, 0.04573296383023262, -0.01784585788846016, 0.020191822201013565, 0.009242165833711624, 0.008580971509218216, -0.015191853046417236, 0.01143794134259224, -0.038518764078617096, 0.00652705505490303, -0.025518907234072685, -0.011169742792844772, 0.028305519372224808, -0.03980670124292374, 0.010324884206056595, -0.006090663373470306, 0.008532963693141937, 0.0174083448946476, 0.03214501217007637, -0.029364097863435745, 0.03213988617062569, -0.033935416489839554, 0.006593812257051468, 0.04269099608063698, -0.0003655441105365753, 0.0014049522578716278, -0.03161410242319107, 0.026467647403478622, -0.016221918165683746, -0.03309209644794464, -0.007796525955200195, -0.03475039079785347, 0.03424244001507759, -0.0001100301742553711, 0.04153857007622719, 0.026387225836515427, -0.04090370982885361, -0.03668109327554703, 0.030400026589632034, -0.012172400951385498, 0.028560128062963486, -0.02326570823788643, 0.003322027623653412, 0.006239570677280426, 0.004264332354068756, 0.031867388635873795, -0.0364314541220665, -0.027714146301150322, 0.03832279518246651, 0.019634734839200974, -0.0478128083050251, 0.017769623547792435, -0.008375108242034912, 0.025805186480283737, -0.033262111246585846, -0.009010732173919678, 0.03929649665951729, 0.04611888900399208, -0.04880871996283531, -0.019473565742373466, -0.022238636389374733, -0.04910954460501671, -0.018884314224123955, -0.0034257397055625916, 0.03069375827908516, 0.020976494997739792, -0.024485481902956963, -0.02349677123129368, -0.004550207406282425, 0.005989633500576019, 0.019790638238191605, 0.044131163507699966, 0.03423513099551201, -0.03857606649398804, -0.020267177373170853, -0.0475580208003521, 0.02668626233935356, -0.010715890675783157, -0.047304511070251465, -0.009186863899230957, -0.00985487550497055, -0.030680645257234573, 0.0382402278482914, -0.012005411088466644, 0.00293731689453125, 0.015081238001585007, -0.01565612480044365, 0.03172392025589943, -0.01597844436764717, 0.040596093982458115, 0.008819092065095901, 0.025435592979192734, -0.04284113645553589, -0.029793739318847656, 0.007297862321138382, 0.022379372268915176, 0.006482444703578949, 0.042824674397706985, 0.0400860570371151, 0.029842738062143326, 0.007042787969112396, -0.040300048887729645, -0.024256480857729912, -0.013097871094942093, -0.02256605587899685, 0.028590265661478043, 0.023043405264616013, 0.021217118948698044, 0.013061989098787308, 0.011712335050106049, -0.036428164690732956, 0.042525243014097214, -0.011329688131809235, -0.020843124017119408, 0.03748739883303642, -0.015230666846036911, -0.03226020187139511, -0.019205188378691673, -0.006463717669248581, 0.016422364860773087, -0.005715381354093552, 0.026746582239866257, 0.024260763078927994, 0.008361946791410446, -0.04131434112787247, -0.010578107088804245, 0.049625132232904434, 0.02745988592505455, 0.0450124628841877, -0.023960543796420097, -0.04781470447778702, 0.0060048699378967285, 0.017275165766477585, 0.025092925876379013, 0.034187201410532, -0.017195403575897217, -0.007398080080747604, -0.021433604881167412, 0.04561343416571617, 0.009550057351589203, 0.0047629475593566895, -0.04408174753189087, 0.016960036009550095, 0.037065353244543076, 0.014269139617681503, -0.01580815389752388, -0.03272203356027603, -0.012519098818302155, -0.0314793735742569, -0.029827464371919632, -0.004372119903564453, 0.04234211519360542, -0.028134120628237724, -0.017693541944026947, 0.039015162736177444, -0.04394606500864029, -0.03810546547174454, 0.027760911732912064, 0.048880551010370255, -0.030512070283293724, 0.031921613961458206, 0.015214595943689346, 0.005198977887630463, -0.041531600058078766, 0.01086973026394844, -0.03479861095547676, 0.007838297635316849, -0.003343723714351654, -0.008767258375883102, -0.017264116555452347, -0.04769059643149376, -0.007988452911376953, -0.033878400921821594, -0.013972200453281403, -0.03539401292800903, 0.030059564858675003, -0.04139794036746025, -0.023914409801363945, -0.01005401462316513, 0.02533116564154625, -0.026113618165254593, -0.03481855243444443, -0.028293658047914505, 0.006568800657987595, -0.003556322306394577, -0.03889737278223038, 0.033282067626714706, 0.009638000279664993, 0.01716475561261177, 0.020529482513666153, -0.007761120796203613, -0.015572596341371536, -0.01731550693511963, -0.02975078858435154, -0.04321644455194473, 0.032460179179906845, 0.026477430015802383, 0.03327489271759987, 0.04966482147574425, -0.015419505536556244, 0.019661355763673782, 0.027150120586156845, -0.017076633870601654, -0.03721131011843681, 0.0019054524600505829, -0.018206465989351273, 0.029863808304071426, -0.03381432592868805, 0.020219076424837112, -0.024694442749023438, -0.04094640165567398, -0.0024438127875328064, 0.008351445198059082, -0.03272207826375961, -0.02579343318939209, 0.04303406551480293, -0.01595170423388481, -0.011749982833862305, 0.017950501292943954, -0.008768249303102493, -0.02754988707602024, -0.04801216349005699, -0.045421745628118515, 0.011569451540708542, -0.004848171025514603, -0.03596804291009903, 0.0038483142852783203, -0.04879406839609146, -0.016763318330049515, 0.015315745025873184, -0.013107918202877045, 0.028653714805841446, 0.03433376923203468, 0.014025140553712845, 0.00952160358428955, 0.03290759399533272, 0.01254333183169365, -0.001995265483856201, -0.018049240112304688, -0.019906628876924515, -0.0016043074429035187, -0.024994218721985817, 0.03647090122103691, 0.025118138641119003, -0.04073358699679375, 0.022065114229917526, 0.019066762179136276, -0.013693202286958694, 0.023976895958185196, 0.036908891052007675, -0.022350966930389404, 0.004004634916782379, -0.003830648958683014, 0.04943915829062462, 0.04900529608130455, -0.034780681133270264, -0.023043561726808548, -0.02475196123123169, -0.015225041657686234, 0.0488760806620121, 0.0230972059071064, 0.048065874725580215, -0.04264269024133682, -0.006027482450008392, -0.043401479721069336, 0.030380401760339737, -0.034073248505592346, 0.02313772216439247, 0.04815829172730446, -0.021109892055392265, 0.029850374907255173, -0.032853804528713226, 0.020964134484529495, 0.016657840460538864, -0.0075828321278095245, 0.04543742164969444, -0.002102125436067581, -0.03396885469555855, 0.026761893182992935, -0.0027696602046489716, 0.012974966317415237, -0.04490609094500542, 0.028759364038705826, 0.03475693240761757, -0.038532961159944534, 0.0234074704349041, 0.008836962282657623, 0.04118629917502403, 0.023000899702310562, -0.011824380606412888, -0.031839895993471146, 0.04227420315146446, 0.03840954229235649, 0.04790768399834633, 0.0134279765188694, -0.005135737359523773, -0.0453697107732296, 0.04373258724808693, -0.013991963118314743, 0.01744253560900688, -0.02641933038830757, 0.03105398640036583, -0.031819380819797516, -0.0037633180618286133, 0.03723624721169472, -0.021760476753115654, 0.020681772381067276, 0.04721624776721001, 0.020579110831022263, -0.04529276117682457, -0.011214576661586761, 0.004886545240879059, 0.004337966442108154, 0.04973452165722847, 0.00538269430398941, -0.028882695361971855, -0.04650980234146118, -0.02625519037246704, -0.004889596253633499, 0.021459225565195084, 0.02275020256638527, -0.019861269742250443, 0.02829015627503395, 0.025626372545957565, -0.042285919189453125, -0.018576599657535553, -0.019447851926088333, -0.03970152139663696, -0.00968552753329277, 0.04880024120211601, 0.0038041099905967712, 0.045090559870004654, 0.045147571712732315, -0.018644560128450394, -0.007628489285707474, 0.048966314643621445, 0.03137334808707237, 0.03393310680985451, 0.02502976730465889, 0.008358646184206009, 0.014942016452550888, -0.03524959087371826, -0.0007417686283588409, 0.002436745911836624, 0.03508475795388222, -0.03969600051641464, 0.04893496260046959, 0.03711744770407677, -0.047435056418180466, 0.03813028708100319, 0.04836202785372734, -0.03978508710861206, -0.04315321519970894, 0.028165247291326523, 0.016582060605287552, 0.03390851989388466, -0.011970411986112595, -0.005414128303527832, -0.0029261335730552673, 0.0018874183297157288, -0.04599801450967789, 0.03752787038683891, -0.017477024346590042, 0.0023085474967956543, 0.013959992676973343, 0.03240231052041054, -0.042201247066259384, -0.047355033457279205, 0.035624969750642776, 0.02030133083462715, 0.016597989946603775, 0.00558244064450264, -0.04055536910891533, -0.0027871839702129364, -0.03264118731021881, 0.030635837465524673, 0.03217336907982826, -0.030541574582457542, 0.012587223201990128, -0.03284187614917755, -0.03344793617725372, -0.03634249046444893, 0.028299879282712936, 0.04274583235383034, -0.012151561677455902, 0.01724565401673317, 0.007211137562990189, -0.027143264189362526, -0.04603920131921768, 0.04841797426342964, -0.008563101291656494, -0.037137292325496674, -0.020359015092253685, -0.013024292886257172, -0.003655731678009033, -0.004757750779390335, -0.007109273225069046, 0.03864702209830284, 0.02578667178750038, -0.019225621595978737, 0.014611069113016129, -0.039133667945861816, -0.01701514795422554, -0.021837353706359863, -0.007530905306339264, -0.04801536723971367, -0.03134860098361969, -0.029840588569641113, 0.04745251312851906, -0.03222246468067169, -0.019134974107146263, -0.02441481314599514, 0.0377049557864666, 0.04615556076169014, -0.04208879545331001, 0.021350745111703873, -0.038479339331388474, -0.0012044534087181091, 0.03466396406292915, 0.04170253500342369, -0.03839694336056709, -0.026264643296599388, -0.012879490852355957, 0.000513959676027298, -0.022692561149597168, 0.011169146746397018, 0.045374635607004166, -0.019894719123840332, 0.02836725488305092, 0.03979799523949623, 0.02440604940056801, 0.01650053635239601, 0.00316624715924263, -0.030357111245393753, -0.029842162504792213, -0.03543590381741524, -0.039161957800388336, -0.00447613000869751, -0.0033118240535259247, -0.007745407521724701, -0.006618212908506393, -0.0410260334610939, -0.03646502643823624, -0.004312358796596527, 0.003455568104982376, -0.001956988126039505, -0.020335603505373, 0.03796673193573952, 0.03372717276215553, -0.030321801081299782, 0.023518789559602737, -0.0294913649559021, -0.029838955029845238, -0.023157775402069092, -0.03760962560772896, 0.03119584545493126, -0.015280723571777344, 0.002219773828983307, 0.010332655161619186, -0.0435984842479229, 0.002812635153532028, -0.030924249440431595, -0.011978019028902054, -0.029702115803956985, 0.03786415234208107, 0.037706222385168076, -0.029268039390444756, -0.023538900539278984, -0.03588167577981949, -0.03220640495419502, 0.03680447116494179, -0.03175099939107895, -0.00484611839056015, 0.026194144040346146, 0.001014113426208496, 0.013744067400693893, -0.03276919201016426, -0.004558969289064407, -0.00423823669552803, -0.020227015018463135, 0.03916272893548012, 0.010653533041477203, -0.035485316067934036, -0.034574318677186966, -0.02734133042395115, -0.0033615119755268097, 0.022365305572748184, 0.035303499549627304, -0.04453829675912857, -0.037742603570222855, -0.01154254749417305, -0.03961944580078125, -0.04601144790649414, 0.0023596175014972687, 0.013315167278051376, 0.03170964494347572, -0.016812574118375778, 0.01494060829281807, -0.014221467077732086, 0.006009519100189209, -0.03275974094867706, 0.029812540858983994, 0.03884812816977501, 0.009488213807344437, -0.0007978193461894989, -0.0016567222774028778, 0.028584588319063187, 0.04380897060036659, -0.01740868017077446, 0.03977716341614723], [0.02077258750796318, -0.021047329530119896, -0.01167534664273262, -0.028266286477446556, -0.0032636895775794983, 0.03182331100106239, 0.028901245445013046, -0.032247819006443024, 0.01614973321557045, 0.006980646401643753, 0.04493296518921852, 0.013635549694299698, 0.008904814720153809, -0.010049842298030853, 0.015422988682985306, -0.009337030351161957, -0.04422180727124214, 0.002735305577516556, -0.03846093267202377, -0.04975615814328194, -0.000729776918888092, -0.008428238332271576, -0.047646429389715195, -0.028741275891661644, -0.020249521359801292, -0.02310580015182495, 0.0007316246628761292, -0.02332385815680027, -0.010282386094331741, 0.000800836831331253, 0.019526232033967972, 0.039949703961610794, -0.02058318816125393, 0.018241871148347855, -0.034135520458221436, 0.034541334956884384, 0.0020711906254291534, -0.036279965192079544, 0.045669663697481155, 0.03556231036782265, 0.004188217222690582, 0.0380692221224308, 0.046111252158880234, -0.008613359183073044, 0.01614164188504219, -0.01428830623626709, 0.004356838762760162, -0.00992494821548462, 0.02084961161017418, -0.03734847158193588, 0.044903505593538284, -0.014109086245298386, -0.0478152297437191, -0.013492833822965622, -0.038578830659389496, -0.03140341117978096, -0.03409477323293686, -0.011133849620819092, 0.031429413706064224, 0.021565984934568405, 0.020865950733423233, -0.04096536710858345, 0.017107199877500534, -0.041935134679079056, 0.04763246700167656, -0.017345786094665527, 0.04974791035056114, -0.002183128148317337, -0.02326669730246067, 0.02568856254220009, 0.01574138179421425, 0.018255960196256638, 0.029991280287504196, 0.022296074777841568, -0.044037412852048874, -0.032496023923158646, -0.027513563632965088, -0.038515351712703705, 0.002574123442173004, 0.021008972078561783, -0.04016369581222534, 0.04782010242342949, 0.04509231075644493, -0.04618266969919205, 0.020322609692811966, 0.031957220286130905, -0.03204075247049332, 0.00907217338681221, -0.03473416715860367, -0.02036457136273384, 0.02781561389565468, -0.039544928818941116, -0.027133524417877197, 0.011672507971525192, -0.003146149218082428, -0.03239493444561958, -0.010729063302278519, 0.0391836054623127, 0.0005486719310283661, -0.0265402439981699, 0.01855572685599327, -0.016532588750123978, 0.042219314724206924, -0.02949986420571804, 0.027875985950231552, 0.0486987866461277, 0.04297531768679619, -0.04004458338022232, -0.003463923931121826, 2.267211675643921e-05, -0.018839716911315918, 0.04502033069729805, 0.043643031269311905, -0.025431597605347633, -0.03126422315835953, 0.035469476133584976, -0.03700052574276924, -0.012233544141054153, 0.03869601711630821, -0.009409736841917038, -0.01912917010486126, -0.0016531571745872498, -0.02560323476791382, -0.0315784215927124, -0.03746996074914932, -0.040996454656124115, -0.034867238253355026, 0.030551467090845108, -0.024527132511138916, -0.003237999975681305, 0.03803621605038643, -0.038805413991212845, -0.0013660192489624023, 0.01933063194155693, 0.022477511316537857, 0.0452544204890728, -0.014885138720273972, 0.03788140043616295, -0.033271729946136475, 0.017307613044977188, -0.0030042752623558044, 0.0013065114617347717, -0.02122516743838787, 0.0448177345097065, 0.00803237035870552, 0.046529415994882584, -0.014760948717594147, 0.0451984666287899, -0.011311374604701996, 0.001756526529788971, 0.030289124697446823, -2.7727335691452026e-05, -0.0018086433410644531, 0.02387482300400734, -0.0012179240584373474, -0.022318268194794655, -0.04294576868414879, -0.007265232503414154, -0.047314416617155075, 0.028428461402654648, 0.010498177260160446, 0.040580544620752335, 0.03291069343686104, -0.02495732344686985, 0.001368653029203415, -0.04200704023241997, 0.016423072665929794, -0.041801489889621735, -0.011306248605251312, -0.02842128276824951, -0.037190090864896774, -0.030819464474916458, 0.021984700113534927, -0.01081235334277153, 0.009756982326507568, -0.00945580005645752, -0.03795069456100464, -0.03929603099822998, -0.013773858547210693, 0.048520948737859726, -0.015386022627353668, 0.011004257947206497, 0.040087904781103134, -0.04640475660562515, 0.03762531653046608, 0.043583404272794724, -0.02788161113858223, 0.0065423473715782166, 0.027814794331789017, 0.04670606926083565, 0.043069783598184586, -0.046897709369659424, 0.002642642706632614, 0.02949366346001625, 0.047342922538518906, 0.03334924206137657, -0.0487203374505043, 0.010283302515745163, 0.037844669073820114, 0.018499042838811874, -0.010285258293151855, -0.028422607108950615, 0.019450616091489792, -0.011672355234622955, -0.046255528926849365, 0.011877287179231644, 0.0003757588565349579, -0.044344522058963776, -0.01769378036260605, -0.00892617553472519, -0.03389006853103638, -0.013470567762851715, 0.004970930516719818, 0.02146003022789955, 0.011141430586576462, -0.0430508628487587, -0.027474557980895042, 0.010667167603969574, 0.023707319051027298, 0.049953389912843704, 0.0033908598124980927, -0.03780953958630562, -0.03946821764111519, 0.0242462195456028, 0.027653489261865616, 0.02276337519288063, -0.022472405806183815, 0.03544049337506294, 0.010932493954896927, -0.013086963444948196, 0.014237713068723679, 0.026891600340604782, 0.03947055712342262, -0.03820878267288208, -0.020385397598147392, 0.024848509579896927, -0.045106638222932816, -0.028173208236694336, -0.047199834138154984, 0.04848948493599892, 0.025409642606973648, 0.030687104910612106, -0.04051809385418892, 0.0025948770344257355, 0.01348525658249855, -0.040876008570194244, 0.008498072624206543, -0.03613869100809097, -0.03856043890118599, 0.017956983298063278, 0.04942646250128746, -0.04015956073999405, 0.037974726408720016, 0.0004242062568664551, -0.023554254323244095, -0.031593192368745804, 0.03857818618416786, 0.047820303589105606, 0.01629059389233589, -0.04554549604654312, 0.022206928580999374, -0.0393189899623394, 0.0037278644740581512, -0.013832233846187592, 0.03831959143280983, -0.03334183990955353, -0.045330870896577835, -0.03815646097064018, -0.0205275546759367, -0.03368430212140083, -0.015268933027982712, 0.035676371306180954, -0.042133964598178864, 0.04854026064276695, -0.041736483573913574, 0.035053376108407974, -0.043159808963537216, -0.03600846603512764, -0.041307080537080765, -0.04930570349097252, 0.0033666864037513733, 0.023326005786657333, 0.043365444988012314, -0.04661159589886665, 0.011205397546291351, 0.03130963072180748, 0.03157125785946846, 0.025958072394132614, -0.011737845838069916, -0.03407038748264313, 0.027728628367185593, 0.0056742653250694275, 0.02938929572701454, 0.031886447221040726, -0.031771935522556305, -0.018794571980834007, 0.03167830780148506, 0.014305699616670609, 0.04695146158337593, -0.040954768657684326, 0.04221923276782036, 0.0387846864759922, -0.003111623227596283, 0.0003639236092567444, -0.022289693355560303, 0.03763573244214058, 0.008306168019771576, 0.0066992416977882385, 0.019043568521738052, 0.01028447225689888, -0.011861525475978851, -0.025856947526335716, 0.024889398366212845, -0.03337033838033676, -0.016128849238157272, -0.04325617477297783, 0.045412253588438034, 0.03395480290055275, 0.008025847375392914, -0.018529437482357025, -0.017960667610168457, 0.03783091530203819, -0.04899425432085991, 0.01572883501648903, 0.04781308397650719, 0.005174815654754639, 0.021042469888925552, 0.018767569214105606, -0.011921621859073639, -0.04517596960067749, 0.030057895928621292, 0.04991931840777397, -0.0385221466422081, -0.025974024087190628, 0.017626475542783737, 0.015234779566526413, -0.02735908143222332, 0.03493329510092735, -0.018685363233089447, -0.035173021256923676, 0.04878172650933266, 0.005847204476594925, 0.02826162800192833, 0.008925378322601318, -0.02647879160940647, 0.01948869600892067, 0.022733811289072037, -0.009968198835849762, -0.025875234976410866, -0.00466831773519516, 0.024474848061800003, -0.034391533583402634, -0.04006095975637436, -0.00468965619802475, -0.007772017270326614, -0.012301065027713776, -0.017656229436397552, 0.04991210624575615, -0.033332131803035736, 0.037452828139066696, 0.03049328550696373, -0.025254560634493828, -0.029293430969119072, -0.01863241195678711, 0.02850339189171791, -0.02580820396542549, 0.033756088465452194, 0.04855490103363991, 0.01942368969321251, 0.02539433166384697, -0.0429670587182045, 0.0006659999489784241, -0.042866576462984085, 0.007429767400026321, 0.0014695897698402405, -0.01109856367111206, -0.003075946122407913, 0.0016838200390338898, 0.0038049332797527313, 0.002901732921600342, -0.008098471909761429, 0.014068033546209335, -0.026497388258576393, 